In [1]:
# שלום רב מצורף פה סקריפט בפייתון ידידותי למשתמש ודאטא אנליסט שמקבל נתונים ומריץ עליהם בדיקות 
#הנתונים הן של נסיעות באובר
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

In [2]:
data = pd.read_csv('UberDataset.csv')

In [3]:
print(data)

            START_DATE          END_DATE  CATEGORY             START  \
0     01-01-2016 21:11  01-01-2016 21:17  Business       Fort Pierce
1     01-02-2016 01:25  01-02-2016 01:37  Business       Fort Pierce
2     01-02-2016 20:25  01-02-2016 20:38  Business       Fort Pierce
3     01-05-2016 17:31  01-05-2016 17:45  Business       Fort Pierce
4     01-06-2016 14:42  01-06-2016 15:49  Business       Fort Pierce
...                ...               ...       ...               ...
1151  12/31/2016 13:24  12/31/2016 13:42  Business           Kar?chi
1152  12/31/2016 15:03  12/31/2016 15:38  Business  Unknown Location
1153  12/31/2016 21:32  12/31/2016 21:50  Business        Katunayake
1154  12/31/2016 22:08  12/31/2016 23:51  Business           Gampaha
1155            Totals               NaN       NaN               NaN

                  STOP    MILES          PURPOSE
0          Fort Pierce      5.1   Meal/Entertain
1          Fort Pierce      5.0              NaN
2          Fort Pierce      4.8  Errand/Supplies
3          Fort Pierce      4.7          Meeting
4      West Palm Beach     63.7   Customer Visit
...                ...      ...              ...
1151  Unknown Location      3.9   Temporary Site
1152  Unknown Location     16.2          Meeting
1153           Gampaha      6.4   Temporary Site
1154         Ilukwatta     48.2   Temporary Site
1155               NaN  12204.7              NaN

[1156 rows x 7 columns]

In [5]:
import matplotlib.pyplot as plt

In [6]:
data.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [9]:
data.info()
# נותן לי מידע על הנתונים

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   START_DATE  1156 non-null   object
 1   END_DATE    1155 non-null   object
 2   CATEGORY    1155 non-null   object
 3   START       1155 non-null   object
 4   STOP        1155 non-null   object
 5   MILES       1156 non-null   float64
 6   PURPOSE     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

In [11]:
print(data.describe())
# נותן לי ערכים סטטיסטיים
# נתן לי בעיקר על המספרים

              MILES
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [12]:
print(data['CATEGORY'].value_counts())
# התפלגות הערכים ב קטגוריות

Business    1078
Personal      77
Name: CATEGORY, dtype: int64

In [29]:
print(data['START'].value_counts().reset_index())

                index  START
0                Cary    201
1    Unknown Location    148
2         Morrisville     85
3         Whitebridge     68
4           Islamabad     57
..                ...    ...
172          Florence      1
173         Ridgeland      1
174     Daytona Beach      1
175          Sky Lake      1
176           Gampaha      1

[177 rows x 2 columns]

In [30]:
df_start_stat= data['START'].value_counts().reset_index()

In [31]:
print (df_start_stat)

                index  START
0                Cary    201
1    Unknown Location    148
2         Morrisville     85
3         Whitebridge     68
4           Islamabad     57
..                ...    ...
172          Florence      1
173         Ridgeland      1
174     Daytona Beach      1
175          Sky Lake      1
176           Gampaha      1

[177 rows x 2 columns]

In [32]:
df_start_stat=pd.DataFrame(data['START'].value_counts().reset_index())
# שים לב חשוב לשים אינדקס משום שזה מוסיף עמודה לפלט

In [33]:
print (df_start_stat)

                index  START
0                Cary    201
1    Unknown Location    148
2         Morrisville     85
3         Whitebridge     68
4           Islamabad     57
..                ...    ...
172          Florence      1
173         Ridgeland      1
174     Daytona Beach      1
175          Sky Lake      1
176           Gampaha      1

[177 rows x 2 columns]

In [36]:
df_start_stat.columns = ["name_of_place","count"]

In [38]:
print(df_start_stat)

        name_of_place  count
0                Cary    201
1    Unknown Location    148
2         Morrisville     85
3         Whitebridge     68
4           Islamabad     57
..                ...    ...
172          Florence      1
173         Ridgeland      1
174     Daytona Beach      1
175          Sky Lake      1
176           Gampaha      1

[177 rows x 2 columns]

In [39]:
df_start_stat.to_csv("start_stat_output.csv")

In [41]:
# נחשב כמה מיילים נסענו

total_miles= data['MILES'].sum()
print(total_miles)

24409.4

In [42]:
print(data.describe())
# נותן לי ערכים סטטיסטיים
# נתן לי בעיקר על המספרים

              MILES
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [44]:
print(data['MILES'].describe())
#דוגמא שתתן את הכל

count     1156.000000
mean        21.115398
std        359.299007
min          0.500000
25%          2.900000
50%          6.000000
75%         10.400000
max      12204.700000
Name: MILES, dtype: float64

In [48]:
#אם הייתי רוצה לחשב לבד את הממוצע
avg_miles= data['MILES'].mean()
print(avg_miles)

# אבל לא צריך חח

21.11539792387542

In [50]:
# כמה ערכים יש בקטגוריה מסוימת?

print(data['CATEGORY'].value_counts())

# צריך להתחיל לשים לב איך עובדת דרישה
# table_name['amooda'].known_func_that_get_data()מבנה אחיג

Business    1078
Personal      77
Name: CATEGORY, dtype: int64

In [52]:
#נחשב סכום של עמודה בלי לסתכל
# הוספנו פלט שמחושב כמו שצריך

print('Total miles driven :' , data['MILES'].sum())

Total miles driven : 24409.4

In [53]:
# נציג את המיילים הממוצעים כפלט
print('average miles driven :' , data['MILES'].mean())

average miles driven : 21.11539792387542

In [55]:
# נבדוק איפה חסר דאטא
# בעזרת 
print('Number of missing values in PURPOSE column:',data.isnull().sum() )

Number of missing values in PURPOSE column: START_DATE      0
END_DATE        1
CATEGORY        1
START           1
STOP            1
MILES           0
PURPOSE       503
dtype: int64

In [ ]:
# כעת נבצע ויזואליזציות